blazedemo_jmeter.yml
execution:
- executor: jmeter
  ramp-up: 5m
  hold-for: 10m
  concurrency:
    local: 20
    cloud: 500
  locations:
    us-west-1: 1
    # us-west-2: 1

  scenario:
    script: ./blazedemo_1.jmx

modules:
  blazemeter:
    workspace: demo workspace
    test: BlazeDemo from Taurus
    report-name: BZD from Taurus
    project: BlazeDemo

reporting:
- module: final-stats
  dump-xml: ./final_stats.xml
settings:
  artifacts-dir: /Users/chefe02/Documents/Demo/blazedemo/Artifacts/%Y-%m-%d_%H-%M-%S.%fbz