blazedemo_jmeter.yml
execution:
- executor: jmeter
  ramp-up: 5m
  hold-for: 10m
  concurrency:
    local: 20
    cloud: 500
  locations:
    us-west-1: 1

  scenario:
    script: ./blazedemo_1.jmx

modules:
  blazemeter:
    workspace: demo workspace
    test: BlazeDemo Jenkins/Taurus
    project: BlazeDemo
    
reporting:
- module: final-stats
  dump-xml: ./final_stats.xml
settings:
  artifacts-dir: /Users/chefe02/Documents/Demo/GIT/BlazeDemoArtifacts/%Y-%m-%d_%H-%M-%S.%fbz